<?php

namespace app\modules\process\models\task_data;

use app\modules\process\models\_query;
use app\modules\process\models\identifiers\Req3Identifiers;
use Yii;
use yii\db\ActiveRecord;

/**
 * This is the model class for table "req3_tasks_data_files".
 *
 * @property integer              $id
 * @property string               $orig_name
 * @property string               $save_name
 * @property string               $path
 *
 * @property Req3TasksDataItems[] $data
 */
class Req3TasksDataFiles extends ActiveRecord
{
    // ============================================================================
    // ============================== КОНСТАНТЫ ===================================
    // ============================================================================

    // ============================================================================
    // ============================== ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ =========================
    // ============================================================================

    // ============================================================================
    // ============================== ИНИТ ========================================
    // ============================================================================
    public function init()
    {
    }

    public static function tableName()
    {
        return 'req3_tasks_data_files';
    }

    public function attributeLabels()
    {
        return [
            'id'        => 'ID',
            'orig_name' => 'Orig Name',
            'save_name' => 'Save Name',
            'path'      => 'Path',
        ];
    }

    public static function find()
    {
        return new _query\Req3TasksDataFilesQuery(get_called_class());
    }

    // ============================================================================
    // ============================== ПРАВИЛА =====================================
    // ============================================================================

    public function rules()
    {
        return [
            [['orig_name', 'save_name', 'path'], 'required'],
            [['orig_name', 'save_name', 'path'], 'string', 'max' => 256],
        ];
    }

    // ============================================================================
    // ============================== СЦЕНАРИИ ====================================
    // ============================================================================
    public function scenarios()
    {
        $scenarios = parent::scenarios();
        return $scenarios;
    }


    public function transactions()
    {
        return [
            //self::SCENARIO_DEFAULT => self::OP_ALL,
        ];
    }

    // ============================================================================
    // ============================== ГЕТТЕРЫ =====================================
    // ============================================================================
    public function getData()
    {
        return $this->hasMany(Req3TasksDataItems::class, ['value_id' => 'id'])->onCondition([Req3TasksDataItems::tableName() . '.type' => Req3Identifiers::TYPE_FILE_1]);
    }

    // ============================================================================
    // ============================== СЕТТЕРЫ =====================================
    // ============================================================================

    // ============================================================================
    // ============================== СОБЫТИЯ СОХРАНЕНИЯ ==========================
    // ============================================================================

    // ============================================================================
    // ============================== СОБЫТИЯ УДАЛЕНИЯ ============================
    // ============================================================================

    // ============================================================================
    // ============================== ЧТО КАСАЕТСЯ OBJECT =========================
    // ============================================================================
    public function getFileSize()
    {
        $directory = Yii::getAlias("@app/modules/process/files/tasks/");
        if (!file_exists($directory . $this->path . $this->save_name)) {
            return 0;
        }
        return filesize($directory . $this->path . $this->save_name);
    }

    public function isAccessView($identification)
    {
        foreach ($this->data as $datum) {
            if ($datum->task) {
                if ($datum->task->isAccessView($identification)) {
                    return true;
                }
            }
        }
        return false;
    }

    // ============================================================================
    // ============================== STATIC ======================================
    // ============================================================================
}
