<?php

namespace app\modules\process\models\identifiers;

use yii\db\ActiveRecord;

/**
 * This is the model class for table "req3_identifier_inform_links".
 *
 * @property integer $id
 * @property integer $version_id
 * @property integer $identifier_id
 * @property integer $identifier_info_id
 */
class Req3IdentifierInformLinks extends ActiveRecord
{
    // ============================================================================
    // ============================== КОНСТАНТЫ ===================================
    // ============================================================================

    // ============================================================================
    // ============================== ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ =========================
    // ============================================================================

    // ============================================================================
    // ============================== ИНИТ ========================================
    // ============================================================================
    public function init()
    {
    }

    public static function tableName()
    {
        return 'req3_identifier_inform_links';
    }


    public function attributeLabels()
    {
        return [
            'id'                 => 'ID',
            'version_id'         => 'Version ID',
            'identifier_id'      => 'Основной идентификатор',
            'identifier_info_id' => 'Информационный идентификатор',
        ];
    }


    public static function find()
    {
        return new \app\modules\process\models\_query\Req3IdentifierInformLinksQuery(get_called_class());
    }

    // ============================================================================
    // ============================== ПРАВИЛА =====================================
    // ============================================================================
    public function rules()
    {
        return [
            [['version_id', 'identifier_id', 'identifier_info_id'], 'required'],
            [['version_id', 'identifier_id', 'identifier_info_id'], 'integer'],
        ];
    }

    // ============================================================================
    // ============================== СЦЕНАРИИ ====================================
    // ============================================================================

    // ============================================================================
    // ============================== ГЕТТЕРЫ =====================================
    // ============================================================================

    // ============================================================================
    // ============================== СЕТТЕРЫ =====================================
    // ============================================================================

    // ============================================================================
    // ============================== СОБЫТИЯ СОХРАНЕНИЯ ==========================
    // ============================================================================

    // ============================================================================
    // ============================== СОБЫТИЯ УДАЛЕНИЯ ============================
    // ============================================================================

    // ============================================================================
    // ============================== ЧТО КАСАЕТСЯ OBJECT =========================
    // ============================================================================

    // ============================================================================
    // ============================== STATIC ======================================
    // ============================================================================
    /**
     * @param self[]                     $links
     * @param                            $to_version_id
     * @param                            $map_identifiers
     */
    public static function copyTo($links, $to_version_id, $map_identifiers)
    {
        foreach ($links as $link) {
            if (isset($map_identifiers[$link->identifier_id]) && isset($map_identifiers[$link->identifier_info_id])) {
                $new_sort = new self();
                $new_sort->version_id = $to_version_id;
                $new_sort->identifier_id = $map_identifiers[$link->identifier_id];
                $new_sort->identifier_info_id = $map_identifiers[$link->identifier_info_id];
                $new_sort->save();
            }
        }
    }
}